Requests_control/src/Catalogs/ОрганыИУчреждения/ОрганыИУчреждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОрганыИУчреждения</name>
  <predefined>
    <items>
      <name>НашеУчреждение</name>
      <description>Наше учреждение</description>
    </items>
  </predefined>
  <attributes>
    <name>ИдентификаторССТУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганУчреждение</name>
    <type>
      <types>EnumRef.ОрганУчреждение</types>
    </type>
  </attributes>
</mdclass:Catalog>

Requests_control/src/Enums/ОрганУчреждение/ОрганУчреждение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОрганУчреждение</name>
  <enumValues>
    <name>Орган</name>
  </enumValues>
  <enumValues>
    <name>Учреждение</name>
  </enumValues>
</mdclass:Enum>

Requests_control/src/Catalogs/ОрганыИУчреждения/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка = Справочники.ОрганыИУчреждения.НашеУчреждение Тогда
		Элементы.ЭтоГосОрган.Видимость = Ложь;
	КонецЕсли;
	
	ЭтоГосОрган = Объект.ОрганУчреждение = Перечисления.ОрганУчреждение.Орган;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПроходитАПК = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоГосОрган Тогда
		ТекущийОбъект.ОрганУчреждение = Перечисления.ОрганУчреждение.Орган;
	Иначе
		ТекущийОбъект.ОрганУчреждение = Перечисления.ОрганУчреждение.Учреждение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
